Repository: MESH-Research/knowledge-commons-works
Catalog: assets/translations/invenio_administration/messages/*/messages.po
Languages: et

source: Search ...
et: Otsi...

source: There is no resources in this category.
et: Selles kategoorias pole ressursse.

source: No matching resources found.
et: Ühtegi sobivat ressurssi ei leitud.

source: results per page
et: tulemust lehel

source: result(s) found
et: tulemus(t) leitud

source: Add
et: Lisa

source: Remove field
et: Eemalda väli

source: Sort
et: Sorteeri

source: Resource is not editable.
et: Ressursi ei saa redigeerida.

source: Edit
et: Redigeeri

source: Resource is not deletable.
et: Ressursi ei saa kustutada.

source: Open list of actions
et: Avage toimingute loend

source: Delete
et: Kustuta

source: Cancel
et: Tühista

source: Delete {{title}}
et: Kustuta {{title}}

source: Are you sure you want to delete {{resourceName}}?
et: Kas olete kindel, et soovite {{resourceName}} kustutada?

source: Error
et: Viga

source: Server was not able to process your request.
et: Server ei saanud teie taotlust töödelda.

source: Save
et: Salvesta

source: Search
et: Otsi

source: Clear query
et: Puhasta otsinguväljad
